//
//  InitialData.swift
//  GazelleCosts
//
//  Created by mac on 17.10.2018.
//  Copyright © 2018 mac. All rights reserved.
//

import Foundation

let categoriParts = ["Двигатель", "Кардан", "Подвеска", "Рулевой_механизм", "Система_охлаждения", "Сцепление", "Электро_оборудование"]

let categoriPartsName = [
    ["Глушитель","Шкив_коленного_вала","Фильтр_масляный","Траверса","Сальники_клапанов","Ролик_натяжной_ремня","Ремень_генератора","Прокладка_головки_блока","Прокладки_двигателя","Поршни_двигателя","Подушка_двигателя","Втулки_клапвнов","Комплект_натяжительного_устройства","Кольца_поршневые","Клапаны_двигателя","Головка_блока_целиндров","Венец_маховика","Шкив_помпы"],
    ["Болты_кардана","Стяжной_болт_кардана","Подвисной_некст","Крестовина","Часть_кардана","Подвисной","Фланец_заднего_моста","Редуктор_заднего_моста","Полуось_задняя"],
    ["Цилиндр_тормозной_главный","Усилитель_тормозной_вакуумный","Втулка_амортизатора","Амортизаторы","Тормозной_целиндр_задний","Фиксатор_задней_тормозной_колодки","Трос_ручника","Стремянка_зад","Колдки_тормозные_задние","Картер_заднего_моста","Диск_опорный","Главная_пара","Барабан_тормозной","Серьга_ресоры","Шпилька_колеса","Шкворень","Шаровая_опора_низ","Шаровая_опора_верх","Лист_ресоры","Колодки_тормозные_передние","Колёсный_диск","Диск_передний_тормозной","Саленблок_ресоры","Болт_ресоры"],
    ["Рулевой_мех","Карданчик_вала_руля","Шарнир_рулевой"],
    ["Радиатор_отопителя","Радиатор_охлаждения","Патрубки_системы_охлаждения","Насос_системы_охлаждения"],
    ["Сцепление","Главный_целиндр_сцепления","Выжимной_подшибник","Вилка_сцепления"],
    ["Электродвигатель_отопления","Бензонасос_электро","Щётки_генератора","Стартер","Свечи_некст","Свечи_405","Втягивающее_реле","Бендекс","Провода_высоковольтные","Переключатель_поворотов","Замок_зажигания","Генератор"]
]

//let forMenuItems = ["Запчасти", "Отчёт по запчастям"]

let masivExtended = [Bool]()
